Masmiseim36/nxpSDK/devices/MKE15Z4/MKE15Z4.xml
        <register>
          <name>MODE</name>
          <description>TSI MODE Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3C0060</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>S_NOISE</name>
              <description>S_NOISE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_NOISE_0</name>
                  <description>noise cancellation off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_NOISE_1</name>
                  <description>noise cancellation on.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_0</name>
                  <description>self-cap mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_1</name>
                  <description>mutual-cap mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETCLK</name>
              <description>SETCLK</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETCLK_0</name>
                  <description>20.72MHz.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETCLK_1</name>
                  <description>16.65MHz.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETCLK_2</name>
                  <description>13.87MHz.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETCLK_3</name>
                  <description>11.91MHz.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_XCH</name>
              <description>S_XCH</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_XCH_0</name>
                  <description>1/16.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_1</name>
                  <description>1/8.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_2</name>
                  <description>1/4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_3</name>
                  <description>1/2.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_4</name>
                  <description>NA.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_5</name>
                  <description>NA.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_6</name>
                  <description>NA.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XCH_7</name>
                  <description>NA.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_XIN</name>
              <description>S_XIN</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_XIN_0</name>
                  <description>1/8.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XIN_1</name>
                  <description>1/4.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_CTRIM</name>
              <description>Capacitor trim setting</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_CTRIM_0</name>
                  <description>Ctrim=2.5p.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_CTRIM_1</name>
                  <description>Ctrim=5.0p.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_CTRIM_2</name>
                  <description>Ctrim=7.5p.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_CTRIM_3</name>
                  <description>Ctrim=10p.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_CTRIM_4</name>
                  <description>Ctrim=12.5p.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_CTRIM_5</name>
                  <description>Ctrim=15p.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_CTRIM_6</name>
                  <description>Ctrim=17.5p.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_CTRIM_7</name>
                  <description>Ctrim=20p.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_SEN</name>
              <description>S_SEN</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_SEN_0</name>
                  <description>Sensitivity boost off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_SEN_1</name>
                  <description>Sensitivity boost on.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_W_SHIELD</name>
              <description>S_W_SHIELD</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_W_SHIELD_0</name>
                  <description>shield switch off.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_W_SHIELD_1</name>
                  <description>shield switch on.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S_XDN</name>
              <description>S_XDN</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>S_XDN_0</name>
                  <description>1/16.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_1</name>
                  <description>1/8.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_2</name>
                  <description>1/4.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_3</name>
                  <description>1/2.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_4</name>
                  <description>NA.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_5</name>
                  <description>NA.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_6</name>
                  <description>NA.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>S_XDN_7</name>
                  <description>NA.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUL0</name>
          <description>TSI MUTUAL-CAP Register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x603F6300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M_SEL_RX</name>
              <description>M_SEL_RX</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_SEL_RX_0</name>
                  <description>select channel 6 as rx6.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_RX_1</name>
                  <description>select channel 7 as rx7.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_RX_2</name>
                  <description>select channel 8 as rx8.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_RX_3</name>
                  <description>select channel 9 as rx9.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_RX_4</name>
                  <description>select channel 10 as rx10.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_RX_5</name>
                  <description>select channel 11 as rx11.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_RX_6</name>
                  <description>NA.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_RX_7</name>
                  <description>NA.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_SEL_TX</name>
              <description>M_SEL_TX</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_SEL_TX_0</name>
                  <description>select channel 0 as tx0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_TX_1</name>
                  <description>select channel 1 as tx1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_TX_2</name>
                  <description>select channel 2 as tx2.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_TX_3</name>
                  <description>select channel 3 as tx3.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_TX_4</name>
                  <description>select channel 4 as tx4.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_TX_5</name>
                  <description>select channel 5 as tx5.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_TX_6</name>
                  <description>NA.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEL_TX_7</name>
                  <description>NA.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_SEN_RES</name>
              <description>M_SEN_RES</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_SEN_RES_0</name>
                  <description>2.5k.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_1</name>
                  <description>5k.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_2</name>
                  <description>7.5k.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_3</name>
                  <description>10k.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_4</name>
                  <description>12.5k.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_5</name>
                  <description>15k.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_6</name>
                  <description>17.5k.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_7</name>
                  <description>20k.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_8</name>
                  <description>22.5k.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_9</name>
                  <description>25k.</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_10</name>
                  <description>27.5k.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_11</name>
                  <description>30k.</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_12</name>
                  <description>32.5k.</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_13</name>
                  <description>35k.</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_14</name>
                  <description>37.5k.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_SEN_RES_15</name>
                  <description>40k.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_PRE_RES</name>
              <description>M_PRE_RES</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_PRE_RES_0</name>
                  <description>1k.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_1</name>
                  <description>2k.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_2</name>
                  <description>3k.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_3</name>
                  <description>4k.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_4</name>
                  <description>5k.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_5</name>
                  <description>6k.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_6</name>
                  <description>7k.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_RES_7</name>
                  <description>8k.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_TX_USED</name>
              <description>M_TX_USED</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>M_PRE_CURRENT</name>
              <description>M_PRE_CURRENT</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_0</name>
                  <description>1uA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_1</name>
                  <description>2uA.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_2</name>
                  <description>3uA.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_3</name>
                  <description>4uA.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_4</name>
                  <description>5uA.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_5</name>
                  <description>6uA.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_6</name>
                  <description>7uA.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M_PRE_CURRENT_7</name>
                  <description>8uA.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
