Masmiseim36/nxpSDK/devices/MKE15Z4/MKE15Z4.xml
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO25</name>
              <description>Port Set Output</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO26</name>
              <description>Port Set Output</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO27</name>
              <description>Port Set Output</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO28</name>
              <description>Port Set Output</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO29</name>
              <description>Port Set Output</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO30</name>
              <description>Port Set Output</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTSO31</name>
              <description>Port Set Output</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTSO_0</name>
                  <description>Corresponding bit in PDORn does not change.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTSO_1</name>
                  <description>Corresponding bit in PDORn is set to logic 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
