Masmiseim36/nxpSDK/devices/MKE15Z4/MKE15Z4.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x320</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>Reserved16</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>Reserved17</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>Reserved18</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>Reserved19</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>Reserved20</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>FTFA</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>LVD_LVW</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>PORTAE</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>LPI2C0</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>Reserved25</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>LPSPI0</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>Reserved27</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>LPUART0</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>LPUART1</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>LPUART2</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>ADC0</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>CMP0</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>FTM0</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>FTM1</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>Reserved35</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>Reserved37</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>LPIT0</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>Reserved39</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>TSI</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>PDB0</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>PORTBCD</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>SCG_RCM</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>WDOG_EWM</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>PWT_LPTMR0</name>
        <value>29</value>
      </interrupt>
      <registers>
        <register>
          <name>NVICISER</name>
          <description>Interrupt Set Enable Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA0</name>
              <description>- interrupt set-enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA0_0</name>
                  <description>write: no effect; read: - interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA0_1</name>
                  <description>write: enable - interrupt; read: - interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA1</name>
              <description>- interrupt set-enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA1_0</name>
                  <description>write: no effect; read: - interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA1_1</name>
                  <description>write: enable - interrupt; read: - interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA2</name>
              <description>- interrupt set-enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA2_0</name>
                  <description>write: no effect; read: - interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA2_1</name>
                  <description>write: enable - interrupt; read: - interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA3</name>
              <description>- interrupt set-enable bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA3_0</name>
                  <description>write: no effect; read: - interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA3_1</name>
                  <description>write: enable - interrupt; read: - interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA4</name>
              <description>- interrupt set-enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA4_0</name>
                  <description>write: no effect; read: - interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA4_1</name>
                  <description>write: enable - interrupt; read: - interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA5</name>
              <description>Single interrupt vector all sources interrupt set-enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA5_0</name>
                  <description>write: no effect; read: Single interrupt vector all sources interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA5_1</name>
                  <description>write: enable Single interrupt vector all sources interrupt; read: Single interrupt vector all sources interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA6</name>
              <description>Low-voltage detect, low-voltage warning interrupt set-enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA6_0</name>
                  <description>write: no effect; read: Low-voltage detect, low-voltage warning interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA6_1</name>
                  <description>write: enable Low-voltage detect, low-voltage warning interrupt; read: Low-voltage detect, low-voltage warning interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA7</name>
              <description>interrupt set-enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA7_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA7_1</name>
                  <description>write: enable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA8</name>
              <description>interrupt set-enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA8_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA8_1</name>
                  <description>write: enable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA9</name>
              <description>interrupt set-enable bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA9_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA9_1</name>
                  <description>write: enable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA10</name>
              <description>interrupt set-enable bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA10_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA10_1</name>
                  <description>write: enable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA11</name>
              <description>interrupt set-enable bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA11_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA11_1</name>
                  <description>write: enable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA12</name>
              <description>interrupt set-enable bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA12_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA12_1</name>
                  <description>write: enable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA13</name>
              <description>interrupt set-enable bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA13_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA13_1</name>
                  <description>write: enable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA14</name>
              <description>interrupt set-enable bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA14_0</name>
                  <description>write: no effect; read: interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA14_1</name>
                  <description>write: enable interrupt; read: interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA15</name>
              <description>Analog-to-Digital Converter 0 interrupt set-enable bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA15_0</name>
                  <description>write: no effect; read: Analog-to-Digital Converter 0 interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA15_1</name>
                  <description>write: enable Analog-to-Digital Converter 0 interrupt; read: Analog-to-Digital Converter 0 interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA16</name>
              <description>Analog comparator 0 interrupt interrupt set-enable bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA16_0</name>
                  <description>write: no effect; read: Analog comparator 0 interrupt interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA16_1</name>
                  <description>write: enable Analog comparator 0 interrupt interrupt; read: Analog comparator 0 interrupt interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA17</name>
              <description>FlexTimer Module 0 interrupt set-enable bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA17_0</name>
                  <description>write: no effect; read: FlexTimer Module 0 interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA17_1</name>
                  <description>write: enable FlexTimer Module 0 interrupt; read: FlexTimer Module 0 interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA18</name>
              <description>FlexTimer Module 1 interrupt set-enable bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA18_0</name>
                  <description>write: no effect; read: FlexTimer Module 1 interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA18_1</name>
                  <description>write: enable FlexTimer Module 1 interrupt; read: FlexTimer Module 1 interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA19</name>
              <description>- interrupt set-enable bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA19_0</name>
                  <description>write: no effect; read: - interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA19_1</name>
                  <description>write: enable - interrupt; read: - interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA20</name>
              <description>Single interrupt vector all sources interrupt set-enable bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA20_0</name>
                  <description>write: no effect; read: Single interrupt vector all sources interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA20_1</name>
                  <description>write: enable Single interrupt vector all sources interrupt; read: Single interrupt vector all sources interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA21</name>
              <description>- interrupt set-enable bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA21_0</name>
                  <description>write: no effect; read: - interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETENA21_1</name>
                  <description>write: enable - interrupt; read: - interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA22</name>
              <description>Periodic timer overflow interrupt set-enable bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETENA22_0</name>
